channelKEpsilon/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS; // Reynolds-Averaged Simulation

RAS
{
    RASModel        kEpsilon; // Select the standard k-epsilon model

    turbulence      on; // Enable turbulence modeling

    printCoeffs     on; // Print model coefficients at simulation start

    // Standard k-epsilon model constants - MUST match paper/PINN
    Cmu             0.09;
    C1              1.44; // == Ceps1 in paper
    C2              1.92; // == Ceps2 in paper
    sigmak          1.0;  // == sigma_k in paper
    sigmaEps        1.3;  // == sigma_eps in paper
}

// ************************************************************************* //