channelKEpsilon/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian; // Assuming Newtonian fluid

nu              [0 2 -1 0 0 0 0] 0.0002; // Kinematic viscosity (m^2/s) - Matches paper/PINN

rho             [1 -3 0 0 0 0 0] 1.0;   // Density (kg/m^3) - Matches paper/PINN

// ************************************************************************* //