channelKEpsilon/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; // m/s

internalField   uniform (1 0 0); // Initial guess (uniform flow)

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0); // U = 1 m/s in x-dir
    }
    outlet
    {
        type            zeroGradient; // Standard outflow condition
    }
    "(bottomWall|topWall)" // Matches blockMeshDict wall names
    {
        type            fixedValue;
        value           uniform (0 0 0); // No-slip condition
    }
    frontAndBack // For 2D cases
    {
        type            empty;
    }
}

// ************************************************************************* //