channelKEpsilon/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p; // Represents kinematic pressure p/rho
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0]; // m^2/s^2

internalField   uniform 0; // Initial guess

boundaryField
{
    inlet
    {
        type            zeroGradient; // Standard inlet condition for pressure
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0; // Set reference pressure level at outlet
    }
    "(bottomWall|topWall)" // Matches blockMeshDict wall names
    {
        type            zeroGradient; // Consistent with wall-normal momentum
    }
    frontAndBack // For 2D cases
    {
        type            empty;
    }
}

// ************************************************************************* //