channelKEpsilon/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut; // Turbulent kinematic viscosity (nu_t)
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0]; // m^2/s

internalField   uniform 0; // Initial guess (calculated from k, epsilon later)

boundaryField
{
    inlet
    {
        type            calculated; // Calculated from k, epsilon if needed
        value           $internalField;
    }
    outlet
    {
        type            calculated; // Standard outflow
        value           $internalField;
    }
    "(bottomWall|topWall)" // Matches blockMeshDict wall names
    {
        type            nutUSpaldingWallFunction; // Spalding wall function for nut (robust)
        // Alternative: nutkWallFunction;
        value           $internalField; // Value calculated by WF
    }
    frontAndBack // For 2D cases
    {
        type            empty;
    }
}

// ************************************************************************* //